{
  "categorias": [
    {
      "id": "3",
      "nome": "Pelúcias"
    },
    {
      "id": "4",
      "nome": "Montessori"
    },
    {
      "id": "5",
      "nome": "Jogos de tabuleiro"
    },
    {
      "id": "6",
      "nome": "Lego"
    },
    {
      "id": "d013",
      "nome": "bonecas"
    },
    {
      "id": "ed1c",
      "nome": "Carrinhos"
    },
    {
      "id": "1c5b",
      "nome": "Jogos"
    }
  ],
  "products": [
    {
      "id": "1",
      "image": "assets/img/6bca124e-2984-4a1d-9a60-9a92749cf036.png",
      "name": "Brinquedo prático para crianças: Guindaste de madeira",
      "description": "Este guindaste de madeira é perfeito para desenvolver habilidades motoras e criatividade em crianças. Fabricado com madeira de reflorestamento de alta qualidade, possui acabamento liso e seguro, sem farpas ou rebarbas. O brinquedo inclui peças móveis que permitem simular operações reais de um guindaste, estimulando o raciocínio lógico e a coordenação motora. Ideal para crianças a partir de 3 anos, este guindaste resistente proporcionará horas de diversão educativa.",
      "categoryId": "1",
      "color": "Natural",
      "size": "Médio",
      "value": 960,
      "quantity": 15,
      "images": [
        "assets/img/6bca124e-2984-4a1d-9a60-9a92749cf036.png"
      ]
    },
    {
      "id": "2",
      "image": "assets/img/83e1e786-a077-46e0-b3f2-afeaa8052e0c.png",
      "name": "Grande conjunto de presente com chocalhos e mordedores para bebês",
      "description": "Este conjunto completo de chocalhos e mordedores é o presente ideal para bebês em fase de desenvolvimento sensorial. Contém 8 peças coloridas com diferentes texturas, sons e formatos, projetadas para estimular os sentidos do bebê. Os mordedores possuem partes macias e texturizadas que aliviam o desconforto durante a dentição. Todos os itens são fabricados com materiais atóxicos, livres de BPA e fáceis de limpar. Recomendado para bebês a partir de 3 meses.",
      "categoryId": "3",
      "color": "Colorido",
      "size": "Pequeno",
      "value": 375,
      "quantity": 20,
      "images": [
        "assets/img/83e1e786-a077-46e0-b3f2-afeaa8052e0c.png"
      ],
      "oldValue": 400,
      "discount": 15
    },
    {
      "id": "3",
      "image": "assets/img/fceb8ab1-7e1a-416a-8b77-f34987ce397d.png",
      "name": "Estrutura de escalada para crianças",
      "description": "Esta estrutura de escalada foi projetada para proporcionar diversão e desenvolvimento físico para crianças. Fabricada com plástico resistente e durável, suporta até 50kg e pode ser usada tanto em ambientes internos quanto externos. A estrutura inclui diferentes níveis de escalada, escorregador e túnel, estimulando a coordenação motora, equilíbrio e confiança. As cores vibrantes e o design lúdico tornam este brinquedo irresistível para as crianças. Montagem fácil e rápida, sem necessidade de ferramentas especiais.",
      "categoryId": "3",
      "color": "Multicolorido",
      "size": "Grande",
      "value": 120,
      "quantity": 8,
      "images": [
        "assets/img/fceb8ab1-7e1a-416a-8b77-f34987ce397d.png"
      ]
    },
    {
      "id": "4",
      "name": "Conjunto de chocalhos de madeira",
      "description": "Este conjunto de chocalhos de madeira traz 5 peças artesanais, cada uma com um som único e agradável. Fabricados com madeira natural e tingidos com corantes não tóxicos à base de água, são seguros para o contato com a boca do bebê. Os diferentes formatos e cores estimulam a percepção visual, enquanto os sons distintos desenvolvem a discriminação auditiva. O tamanho é ideal para as mãozinhas dos bebês, ajudando no desenvolvimento da preensão. Recomendado para bebês a partir de 6 meses.",
      "categoryId": 2,
      "color": "Madeira",
      "size": "Pequeno",
      "value": 370,
      "oldValue": 400,
      "discount": 30,
      "quantity": 12,
      "image": "assets/img/090319b0-9695-4ca2-b7e3-21908538d7e0.png",
      "images": [
        "assets/img/090319b0-9695-4ca2-b7e3-21908538d7e0.png"
      ],
      "isFavorite": false,
      "feedbacks": [
        {
          "name": "Ana Silva",
          "rating": 5,
          "date": "2023-10-15",
          "comment": "Meu bebê adorou! Os chocalhos têm sons suaves e agradáveis, e a madeira é de ótima qualidade. Recomendo para estimular a audição e coordenação motora."
        },
        {
          "name": "Carlos Oliveira",
          "rating": 4,
          "date": "2023-09-28",
          "comment": "Produto bom, com acabamento impecável. Os sons são diferentes entre si, o que é ótimo para o desenvolvimento auditivo. Só não dou 5 estrelas porque um dos chocalhos veio com o som mais baixo que os outros."
        },
        {
          "name": "Beatriz Lima",
          "rating": 5,
          "date": "2023-09-03",
          "comment": "Chocalhos lindos e de excelente qualidade! Minha filha adora as cores vibrantes e os diferentes sons. Ótimo para estimular os sentidos do bebê."
        }
      ]
    },
    {
      "id": "5",
      "name": "Kit de blocos de construção magnéticos",
      "description": "Este kit de blocos magnéticos contém 60 peças coloridas que se conectam facilmente através de ímãs embutidos. Ideal para estimular a criatividade e o raciocínio espacial, permite a construção de estruturas 2D e 3D. As peças são grandes o suficiente para evitar riscos de engasgamento e fabricadas com plástico ABS de alta qualidade. O conjunto vem em uma caixa organizadora e inclui um guia com sugestões de construções. Perfeito para crianças a partir de 3 anos que gostam de criar e explorar.",
      "categoryId": "5",
      "color": "Colorido",
      "size": "Médio",
      "value": 450,
      "oldValue": 520,
      "discount": 15,
      "quantity": 10,
      "image": "assets/img/6bca124e-2984-4a1d-9a60-9a92749cf036.png",
      "images": [
        "assets/img/6bca124e-2984-4a1d-9a60-9a92749cf036.png"
      ],
      "isFavorite": false,
      "feedbacks": [
        {
          "name": "Marcelo Souza",
          "rating": 5,
          "date": "2023-11-02",
          "comment": "Brinquedo fantástico! Meu filho de 4 anos fica horas construindo diferentes estruturas. Os ímãs são fortes e as peças se encaixam perfeitamente. Ótimo para desenvolver a criatividade."
        },
        {
          "name": "Daniela Ferreira",
          "rating": 4,
          "date": "2023-10-14",
          "comment": "Kit muito bom para estimular o raciocínio espacial. As crianças adoram construir e os ímãs facilitam a montagem. Só não dou 5 estrelas porque a caixa organizadora poderia ser mais resistente."
        },
        {
          "name": "Rodrigo Martins",
          "rating": 5,
          "date": "2023-09-25",
          "comment": "Excelente brinquedo educativo! Meus filhos de 3 e 6 anos brincam juntos e desenvolvem habilidades importantes. As peças são coloridas e de ótima qualidade."
        }
      ]
    },
    {
      "id": "6",
      "name": "Boneca interativa com sons e movimentos",
      "description": "Esta boneca interativa responde ao toque e à voz com mais de 50 sons e frases diferentes. Seus braços e pernas são articulados, permitindo diversas posições. Os olhos se abrem e fecham, e ela emite sons de risada quando balançada. Vem vestida com roupas removíveis e laváveis, e acompanha mamadeira, chupeta e uma muda extra de roupa. Funciona com 3 pilhas AA (inclusas). A boneca estimula o cuidado, a afetividade e a imaginação em crianças a partir de 2 anos.",
      "categoryId": 4,
      "color": "Rosa",
      "size": "Médio",
      "value": 290,
      "oldValue": 350,
      "discount": 20,
      "quantity": 18,
      "image": "assets/img/83e1e786-a077-46e0-b3f2-afeaa8052e0c.png",
      "images": [
        "assets/img/83e1e786-a077-46e0-b3f2-afeaa8052e0c.png"
      ],
      "isFavorite": false,
      "feedbacks": [
        {
          "name": "Patrícia Lopes",
          "rating": 5,
          "date": "2023-10-30",
          "comment": "Minha filha amou esta boneca! As interações são muito realistas e as roupas são de ótima qualidade. Ela brinca de mamãe e filhinha o dia todo."
        },
        {
          "name": "Gabriel Moreira",
          "rating": 4,
          "date": "2023-10-08",
          "comment": "Boneca muito bem feita e com ótimas funções interativas. As pilhas duram bastante tempo. O único ponto negativo é que algumas frases são um pouco baixas."
        },
        {
          "name": "Luciana Vieira",
          "rating": 5,
          "date": "2023-09-15",
          "comment": "Presente perfeito! Minha sobrinha não larga a boneca. Os sons são variados e as roupas são fáceis de trocar. Ótimo para estimular o cuidado e a responsabilidade."
        }
      ]
    }
  ],
  "customers": [
    {
      "id": "b822",
      "name": "Fulano Teste",
      "dateOfBirth": "2004-01-01",
      "cpf": "123.456.789-00",
      "rg": "12.345.678-9",
      "email": "Fulano@123",
      "telephone": "11 9 1123-4567",
      "password": "1234"
    },
    {
      "id": "7ebf",
      "name": "Giulia",
      "dateOfBirth": "2004-08-17",
      "cpf": "44778704851",
      "rg": "397306544",
      "email": "giualciati@gmail.com",
      "telephone": "11961542672",
      "password": "989317"
    }
  ]
}